In [1]:
import pandas as pd
import os

In [2]:
PATH = "../Datasets/WindDirection/"

In [3]:
titles = os.listdir(PATH)

Reading files

In [4]:
df = pd.read_excel(PATH + titles[0])

In [5]:
df

      Parámetro       Fecha  valor Unidad
0           NaN         NaN    NaN    NaN
1            DV  2018-03-02  194.0     °A
2            DV  2018-03-02  227.0     °A
3            DV  2018-03-02  233.0     °A
4            DV  2018-03-02  231.0     °A
...         ...         ...    ...    ...
17310        DV  2020-03-02  204.0     °A
17311        DV  2020-03-02  207.0     °A
17312        DV  2020-03-02  209.0     °A
17313        DV  2020-03-02  232.0     °A
17314        DV  2020-03-02  162.0     °A

[17315 rows x 4 columns]

Dropping empty instances

In [7]:
df.dropna(how='all', inplace=True)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17314 entries, 1 to 17314
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  17314 non-null  object
 1   Fecha      17314 non-null  object
 2   valor      17314 non-null  float64
 3   Unidad     17314 non-null  object
dtypes: float64(1), object(3)
memory usage: 676.3+ KB

Creating the complete dataset

In [9]:
for df_i in titles[1:]:
    df_i = pd.read_excel(PATH + df_i)
    df_i = df_i.dropna(how='all')
    df = pd.concat([df, df_i], axis=0)

In [10]:
df

     Parámetro       Fecha  valor Unidad
1           DV  2018-03-02  194.0     °A
2           DV  2018-03-02  227.0     °A
3           DV  2018-03-02  233.0     °A
4           DV  2018-03-02  231.0     °A
5           DV  2018-03-02  194.0     °A
...        ...         ...    ...    ...
7548        DV  2025-03-09  208.0     °A
7549        DV  2025-03-09  201.0     °A
7550        DV  2025-03-09  206.0     °A
7551        DV  2025-03-09  212.0     °A
7552        DV  2025-03-09  206.0     °A

[55495 rows x 4 columns]

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 55495 entries, 1 to 7552
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  55495 non-null  object
 1   Fecha      55495 non-null  object
 2   valor      55495 non-null  float64
 3   Unidad     55495 non-null  object
dtypes: float64(1), object(3)
memory usage: 2.1+ MB

Dropping unnecessary columns

In [12]:
df.drop(["Parámetro", "Unidad"], axis=1, inplace=True)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 55495 entries, 1 to 7552
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   55495 non-null  object
 1   valor   55495 non-null  float64
dtypes: float64(1), object(1)
memory usage: 1.3+ MB

Formating dates

In [14]:
df["Fecha"] = pd.to_datetime(df["Fecha"])

In [15]:
df.head()

       Fecha  valor
1 2018-03-02  194.0
2 2018-03-02  227.0
3 2018-03-02  233.0
4 2018-03-02  231.0
5 2018-03-02  194.0

Changing column names

In [16]:
df.rename(columns={"valor":"WindDirection"}, inplace=True)

In [17]:
df

          Fecha  WindDirection
1    2018-03-02          194.0
2    2018-03-02          227.0
3    2018-03-02          233.0
4    2018-03-02          231.0
5    2018-03-02          194.0
...         ...            ...
7548 2025-03-09          208.0
7549 2025-03-09          201.0
7550 2025-03-09          206.0
7551 2025-03-09          212.0
7552 2025-03-09          206.0

[55495 rows x 2 columns]

Grouping per day and taking in consideration the mode

In [19]:
df = df.groupby("Fecha", as_index=False).agg({"WindDirection": lambda x: x.mode().iloc[0]})

In [20]:
df

          Fecha  WindDirection
0    2018-03-02          194.0
1    2018-03-03          175.0
2    2018-03-04          226.0
3    2018-03-05          213.0
4    2018-03-06          239.0
...         ...            ...
2336 2025-03-05          194.0
2337 2025-03-06          223.0
2338 2025-03-07          209.0
2339 2025-03-08          145.0
2340 2025-03-09          206.0

[2341 rows x 2 columns]

In [22]:
df.to_csv(PATH + "WindDirection.csv", index=False)